[
    {
      "id": "1",
      "title": "EarnIt - PocketMentor",
      "description": "Full stack MERN application - a salary comparison website",
      "detailedDescription" :"The application I developed was based on a design submitted by UX/UI designers, during a full-time coding bootcamp in Berlin in winter 2024. I coded the client-side, using an SPA Frontend created with React, consisting of multiple views and CRUD functionalities. I also created a backend using an Express.js framework and a connection to a cloud REST API database hosted by Mongo Altas. In order to connect my backend with the database, I used mongoose. The backend has a few models for the user quiz and a user model for user authentication. User authentication is based on a JWT token and enables the user to sign up, sign in and sign out and also to delete their data altogether. My backend has a centralized error handling. The first response from the server is tardy, due to the restrictions of Render, which I used to deploy my backend. The app is fully responsive.",
      "image": "./earnit2.png",
      "github": "https://github.com/pikkukurkku/EarnIT",
      "deployed": "http://visionary-dieffenbachia-36ce76.netlify.app/",
      "techStack": ["React", "Node.js", "Express.js", "Mongo DB", "mongoose", "HTML", "CSS", "JavaScript", "Axios", "Render", "Netlify", "JSX", "Vite"]
    },
    {
      "id": "2",
      "title": "Hikelove",
      "description": "A hiking app built with React and a mock JSON server",
      "detailedDescription" :"The application I developed is loosely based on similar outdoor apps, like Outdooractive and AllTrails. On the initial rendering, the homepage displays random three hikes from a JSON file, which is deployed separately and serves as a database for the frontend calls. I am also fetching data from two external APIs, one of them being the Leaflet/Openstreetmap API for the exact location of the summit, the other one is a 3-day weather forecast for the location, provided by the AccuWeather API. The application uses CRUD functionalities for reviews - the user can display, add, edit and delete a review. The app is fully responsive.",
      "image": "./download.png",
      "github": "https://github.com/pikkukurkku/react_project",
      "deployed": "https://pikkukurkku.github.io/react_project/",
      "techStack": ["React", "Node.js", "HTML", "CSS", "JavaScript", "JSON server", "Axios", "JSX", "Vite"]
    },
    {
      "id": "3",
      "title": "Polski Quiz",
      "description": "A quirky quiz about Poland and a nod to the 80s arcade games",
      "detailedDescription" :"This simple game was created without a framework. It is pure JavaScript/HTML/CSS (with sound effects!). I am using DOM manipulation to add interactivity to the HTML. The quiz has a logic for winning/losing and it's entities and elements are organized using classes and OOP. As the game is a nod to the 80s arcade games, it needs to be played on a laptop/PC. Afterall, there were no mobile phones in the 80s :)",
      "image": "./EndScreen.png",
      "github": "https://github.com/pikkukurkku/polski_quiz",
      "deployed": "http://pikkukurkku.github.io/polski_quiz/",
      "techStack": ["HTML", "CSS", "JavaScript", "Object Oriented Programming", "DOM manipulation"],
      "demo1": "./screenrecording.mp4"
    },
    {
      "id": "4",
      "title": "Temperature converter",
      "description": "A super simple application for converting Fahrenheit into Celsius",
      "detailedDescription" :"In this project, I am for the first time combining my html and css knowledge with some javascript content, to make a website do something. I'm using youtube videos and articles found on Google as help, as well as chat gpt (version 3.5). Plus my own knowledge from the multiple codecademy and ironhack courses I have done in the past few months.The app is not fully responsive - best to view on a mobile phone",
      "image": "./converter.png",
      "github": "https://github.com/pikkukurkku/temperature_converter",
      "deployed": "https://pikkukurkku.github.io/temperature_converter/",
      "techStack": ["HTML", "CSS", "JavaScript", "DOM manipulation"]
    }
  ]